Public Attributes | List of all members
API_ConstraintPars Struct Reference
User input management
Parameters of the drawing constraint. More...
#include <APIdefs_Interface.h>
 Public Attributes
 API_ConstraintType  | constType
Type of the drawing constraint.
 double  | constValue
The value of the constraint.
 bool  | useLocOrigo
Use the project origin or the last clicked point (locOrigo) as the reference point.
Detailed Description
Parameters of the drawing constraint.
Remarks
For the utilization of API_ConstraintPars see the ACAPI_UserInput_SetConstraint interface function.